{
  "title": "The Download: the story of OpenAI, and making magnesium",
  "link": "https://www.technologyreview.com/2025/05/28/1117492/the-download-the-story-of-openai-and-making-magnesium/",
  "author": "",
  "pub_date": "Wed, 28 May 2025 12:10:00 +0000",
  "categories": [
    "The Download"
  ],
  "article": "This is today’s edition ofThe Download,our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\n\nOpenAI: The power and the pride\n\nOpenAI’s release of ChatGPT 3.5 set in motion an AI arms race that has changed the world.\n\nHow that turns out for humanity is something we are still reckoning with and may be for quite some time. But a pair of recent books both attempt to get their arms around it.InEmpire of AI: Dreams and Nightmares in Sam Altman’s OpenAI, Karen Hao tells the story of the company’s rise to power and its far-reaching impact all over the world. Meanwhile,The Optimist: Sam Altman, OpenAI, and the Race to Invent the Future, by theWall Street Journal’s Keach Hagey, homes in more on Altman’s personal life, from his childhood through the present day, in order to tell the story of OpenAI.\n\nBoth paint complex pictures and show Altman in particular as a brilliantly effective yet deeply flawed creature of Silicon Valley—someone capable of always getting what he wants, but often by manipulating others.Read the full review.—Mat Honan\n\nThis startup wants to make more climate-friendly metal in the US\n\nThe news:A California-based company called Magrathea just turned on a new electrolyzer that can make magnesium metal from seawater. The technology has the potential to produce the material, which is used in vehicles and defense applications, with net-zero greenhouse-gas emissions.\n\nWhy it matters:Today, China dominates production of magnesium, and the most common method generates a lot of the emissions that cause climate change. If Magrathea can scale up its process, it could help provide an alternative source of the metal and clean up industries that rely on it, including automotive manufacturing.Read the full story.\n\n—Casey Crownhart\n\nA new sodium metal fuel cell could help clean up transportation\n\nA new type of fuel cell that runs on sodium metal could one day help clean up sectors where it’s difficult to replace fossil fuels, like rail, regional aviation, and short-distance shipping. The device represents a departure from technologies like lithium-based batteries and is more similar conceptually to hydrogen fuel cell systems.The sodium-air fuel cell has a higher energy density than lithium-ion batteries and doesn’t require the super-cold temperatures or high pressures that hydrogen does, making it potentially more practical for transport.Read the full story.\n\n—Casey Crownhart\n\nThe must-reads\n\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n\n1 The US state department is considering vetting foreign students’ social mediaAfter ordering US embassies to suspend international students’ visa appointments. (Politico)+Applicants’ posts, shares and comments could be assessed.(The Guardian)+The Trump administration also wants to cut off Harvard’s funding.(NYT$)\n\n2 SpaceX’s rocket exploded during its test flightIt’s the third consecutive explosion the company has suffered this year. (CNBC)+It was the first significant attempt to reuse Starship hardware.(Space)+Elon Musk is fairly confident the problem with the engine bay has been resolved.(Ars Technica)3 The age of AI layoffs is hereAnd it’s taking place in conference rooms, not on factory floors. (Quartz)+People are worried that AI will take everyone’s jobs. We’ve been here before.(MIT Technology Review)4 Thousands of IVF embryos in Gaza were destroyed by Israeli strikesAn attack destroyed the fertility clinic where they were housed. (BBC)+Inside the strange limbo facing millions of IVF embryos.(MIT Technology Review)\n\n5 China’s overall greenhouse gas emissions have fallen for the first timeEven as energy demand has risen. (Vox)+China’s complicated role in climate change.(MIT Technology Review)\n\n6 The sun is damaging Starlink’s satellitesIts eruptions are reducing the satellite’s lifespans. (New Scientist$)+Apple’s satellite connectivity dreams are being thwarted by Musk.(The Information$)\n\n7 European companies are struggling to do business in ChinaEven the ones that have operated there for decades. (NYT$)+The country’s economic slowdown is making things tough.(Bloomberg$)\n\n8 US hospitals are embracing helpful robotsThey’re delivering medications and supplies so nurses don’t have to. (FT$)+Will we ever trust robots?(MIT Technology Review)\n\n9 Meet the people who write the text messages on your favorite showThey try to make messages as realistic, and intriguing, as possible. (The Guardian)\n\n10 Robot dogs are delivering parcels in AustinWell, over 100 yard distances at least. (TechCrunch)\n\nQuote of the day\n\n“I wouldn’t say there’s hope. I wouldn’t bet on that.”\n\n—Michael Roll, a partner at law firm Roll & Harris, explains toWiredwhy businesses shouldn’t get their hopes up over obtaining refunds for Donald Trump’s tariff price hikes.\n\nOne more thing\n\nIs the digital dollar dead?In 2020, digital currencies were one of the hottest topics in town. China was well on its way to launching its own central bank digital currency, or CBDC, and many other countries launched CBDC research projects, including the US.How things change. The digital dollar—even though it doesn’t exist—has now become political red meat, as some politicians label it a dystopian tool for surveillance. So is the dream of the digital dollar dead?Read the full story.\n\n—Mike Orcutt\n\nWe can still have nice things\n\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas?Drop me a lineorskeet ’em at me.)\n\n+ Recently returned from vacation? Here’s how to cope with comingback to reality.+Reconnecting with friendsis one of life’s great joys.+ A new Parisian cocktail bar has done away withiceentirely in a bid to be more sustainable.+ Why beingboredis good for you—no, really."
}