{
  "title": "The Download: the next anti-drone weapon, and powering AI’s growth",
  "link": "https://www.technologyreview.com/2025/05/29/1117539/the-download-the-next-anti-drone-weapon-and-powering-ais-growth/",
  "author": "",
  "pub_date": "Thu, 29 May 2025 12:15:00 +0000",
  "categories": [
    "The Download"
  ],
  "article": "This is today’s edition ofThe Download,our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\n\nThis giant microwave may change the future of war\n\nImagine: China deploys hundreds of thousands of autonomous drones in the air, on the sea, and under the water—all armed with explosive warheads or small missiles. These machines descend in a swarm toward military installations on Taiwan and nearby US bases, and over the course of a few hours, a single robotic blitzkrieg overwhelms the US Pacific force before it can even begin to fight back.The proliferation of cheap drones means just about any group with the wherewithal to assemble and launch a swarm could wreak havoc, no expensive jets or massive missile installations required.The US armed forces are now hunting for a solution—and they want it fast. Every branch of the service and a host of defense tech startups are testing out new weapons that promise to disable drones en masse.\n\nAnd one of these is microwaves: high-powered electronic devices that push out kilowatts of power to zap the circuits of a drone as if it were the tinfoil you forgot to take off your leftovers when you heated them up.Read the full story.\n\n—Sam Dean\n\nThis article is part of the Big Story series:MIT Technology Review’s most important, ambitious reporting that takes a deep look at the technologies that are coming next and what they will mean for us and the world we live in.Check out the rest of them here.\n\nWhat will power AI’s growth?\n\nLast week we publishedPower Hungry, a series that takes a hard look at the expected energy demands of AI. Last week in this newsletter, I broke down its centerpiece, ananalysisI did with my colleague James O’Donnell.But this week, I want to talk about another story that I also wrote for that package, which focused on nuclear energy. As I discovered, building new nuclear plants isn’t so simple or so fast. And as my colleague David Rotman lays out in his story,the AI boom could wind up relying on another energy source: fossil fuels. So what’s going to power AI?Read the full story.\n\n—Casey Crownhart\n\nThis article is from The Spark, MIT Technology Review’s weekly climate newsletter. To receive it in your inbox every Wednesday,sign up here.\n\nThe must-reads\n\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n\n1 Elon Musk is leaving his role in the Trump administrationTo focus on rebuilding the damaged brand reputations of Tesla and SpaceX. (Axios)+Musk has complained that DOGE has become a government scapegoat.(WP$)+Tesla shareholders have asked its board to lay out a succession plan.(CNN)+DOGE’s tech takeover threatens the safety and stability of our critical data.(MIT Technology Review)\n\n2 The US will start revoking the visas of Chinese studentsIncluding those studying in what the US government deems “critical fields.” (Politico)+It’s also ordered US chip software suppliers to stop selling to China.(FT$)\n\n3 The US is storing the DNA of migrant childrenIt’s been uploaded into a criminal database to track them as they age. (Wired$)+The US wants to use facial recognition to identify migrant children as they age.(MIT Technology Review)\n\n4 RFK Jr is threatening to ban federal scientists from top journalsInstead, they may be forced to publish in state-run alternatives. (The Hill)+He accused major medical journals of being funded by Big Pharma.(Stat)\n\n5 India and Pakistan are locked in disinformation warfareFalse reports and doctored images are circulating online. (The Guardian)+Fact checkers are working around the clock to debunk fake news.(Reuters)\n\n6 How North Korea is infiltrating remote jobs in the USWith the help of regular Americans. (WSJ$)\n\n7 This Discord community is creating its own hair-growth drugsMen are going to extreme lengths to reverse their hair loss. (404 Media)\n\n8 Inside YouTube’s quest to dominate your living roomIt wants to move away from controversial clips and into prestige TV. (Bloomberg$)\n\n9 Sergey Brin threatens AI models with physical violenceThe Google co-founder insists that it produces better results. (The Register)\n\n10 It must be nice to be a moving day influencerThey reap all of the benefits, with none of the stress. (NY Mag$)\n\nQuote of the day\n\n“I studied in the US because I loved what America is about: it’s open, inclusive and diverse. Now my students and I feel slapped in the face by Trump’s policy.”\n\n—Cathy Tu, a Chinese AI researcher, tellsthe Washington Postwhy many of her students are already applying to universities outside the US after the Trump administration announced a crackdown on visas for Chinese students.\n\nOne more thing\n\nThe second wave of AI coding is hereAsk people building generative AI what generative AI is good for right now—what they’re really fired up about—and many will tell you: coding.Everyone from established AI giants to buzzy startups is promising to take coding assistants to the next level. Instead of providing developers with a kind of supercharged autocomplete, this next generation can prototype, test, and debug code for you. The upshot is that developers could essentially turn into managers, who may spend more time reviewing and correcting code written by a model than writing it from scratch themselves.But there’s more. Many of the people building generative coding assistants think that they could be a fast track to artificial general intelligence, the hypothetical superhuman technology that a number of top firms claim to have in their sights.Read the full story.\n\n—Will Douglas Heaven\n\nWe can still have nice things\n\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas?Drop me a lineorskeet ’em at me.)\n\n+ If you’ve ever dreamed of owning a piece of cinematic history, more than 400 ofDavid Lynch’s personal itemsare going up for auction.+ How accurate are those Hollywood films based on true stories?Let’s find out.+ Rest in peace Chicago Mike: the legendary hype man toKool & the Gang.+ How to fullytrustin one another."
}