{
  "title": "The Download: sycophantic LLMs, and the AI Hype Index",
  "link": "https://www.technologyreview.com/2025/05/30/1117620/the-download-sycophantic-llms-and-the-ai-hype-index/",
  "author": "",
  "pub_date": "Fri, 30 May 2025 12:10:00 +0000",
  "categories": [
    "The Download"
  ],
  "article": "This is today’s edition ofThe Download,our weekday newsletter that provides a daily dose of what’s going on in the world of technology.\n\nThis benchmark used Reddit’s AITA to test how much AI models suck up to us\n\nBack in April, OpenAI announced it was rolling back an update to its GPT-4o model that made ChatGPT’s responses to user queries too sycophantic.An AI model that acts in an overly agreeable and flattering way is more than just annoying. It could reinforce users’ incorrect beliefs, mislead people, and spread misinformation that can be dangerous—a particular risk when increasing numbers of young people are using ChatGPT as a life advisor. And because sycophancy is difficult to detect, it can go unnoticed until a model or update has already been deployed.A new benchmark called Elephant that measures the sycophantic tendencies of major AI models could help companies avoid these issues in the future. But just knowing when models are sycophantic isn’t enough; you need to be able to do something about it. And that’s trickier.Read the full story.\n\n—Rhiannon Williams\n\nThe AI Hype Index\n\nSeparating AI reality from hyped-up fiction isn’t always easy. That’s why we’ve created the AI Hype Index—a simple, at-a-glance summary of everything you need to know about the state of the industry.Take a look at this month’s edition of the index here.\n\nThe must-reads\n\nI’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology.\n\n1 Anduril is partnering with Meta to build an advanced weapons systemEagleEye’s VR headsets will enhance soldiers’ hearing and vision. (WSJ$)+Palmer Luckey wants to turn “warfighters into technomancers.”(TechCrunch)+Luckey and Mark Zuckerberg have buried the hatchet, then.(Insider$)+Palmer Luckey on the Pentagon’s future of mixed reality.(MIT Technology Review)2 A new Texas law requires app stores to verify users’ agesIt’s following in Utah’s footsteps, which passed a similar bill in March. (NYT$)+Apple has pushed back on the law.(CNN)3 What happens to DOGE now?It has lost its leader and a top lieutenant within the space of a week. (WSJ$)+Musk’s departure raises questions over how much power it will wield without him.(The Guardian)+DOGE’s tech takeover threatens the safety and stability of our critical data.(MIT Technology Review)\n\n4 NASA’s ambitions of a 2027 moon landing are looking less likelyIt needs SpaceX’s Starship, which keeps blowing up. (WP$)+Is there a viable alternative?(New Scientist$)\n\n5 Students are using AI to generate nude images of each otherIt’s a grave and growing problem that no one has a solution for. (404 Media)\n\n6 Google AI Overviews doesn’t know what year it isA year after its introduction, the feature is still making obvious mistakes. (Wired$)+Google’s new AI-powered search isn’t fit to handle even basic queries.(NYT$)+The company is pushing AI into everything. Will it pay off?(Vox)+Why Google’s AI Overviews gets things wrong.(MIT Technology Review)\n\n7 Hugging Face has created two humanoid robotsThe machines are open source, meaning anyone can build software for them. (TechCrunch)\n\n8 A popular vibe coding app has a major security flawDespite being notified about it months ago. (Semafor)+Any AI coding program catering to amateurs faces the same issue.(The Information$)+What is vibe coding, exactly?(MIT Technology Review)\n\n9 AI-generated videos are becoming way more realisticBut not when it comes to depicting gymnastics. (Ars Technica)\n\n10 This electronic tattoo measures your stress levelsConsider it a mood ring for your face. (IEEE Spectrum)\n\nQuote of the day\n\n“I think finally we are seeing Apple being dragged into the child safety arena kicking and screaming.”\n\n—Sarah Gardner, CEO of child safety collective Heat Initiative, tellsthe Washington Postwhy Texas’ new app store law could signal a turning point for Apple.\n\nOne more thing\n\nHouse-flipping algorithms are coming to your neighborhoodWhen Michael Maxson found his dream home in Nevada, it was not owned by a person but by a tech company, Zillow. When he went to take a look at the property, however, he discovered it damaged by a huge water leak. Despite offering to handle the costly repairs himself, Maxson discovered that the house had already been sold to another family, at the same price he had offered.During this time, Zillow lost more than $420 million in three months of erratic house buying and unprofitable sales, leading analysts to question whether the entire tech-driven model is really viable. For the rest of us, a bigger question remains: Does the arrival of Silicon Valley tech point to a better future for housing or an industry disruption to fear?Read the full story.\n\n—Matthew Ponsford\n\nWe can still have nice things\n\nA place for comfort, fun and distraction to brighten up your day. (Got any ideas?Drop me a lineorskeet ’em at me.)\n\n+ A100-mile real-time ultramarathon video gamethat lasts anywhere up to 27 hours is about as fun as it sounds.+ Here’s howedible glittercould help save the humble water vole from extinction.+ Cleaning massivestatuesis not for the faint-hearted ($)+ When is a flute teacher not a flautist? When he’s awhistleblower."
}