{
  "title": "Sam Altman biographer Keach Hagey explains why the OpenAI CEO was ‘born for this moment’",
  "date": "Sun, 01 Jun 2025 15:43:54 +0000",
  "link": "https://techcrunch.com/2025/06/01/sam-altman-biographer-keach-hagey-explains-why-the-openai-ceo-was-born-for-this-moment/",
  "summary": "In “The Optimist: Sam Altman, OpenAI, and the Race to Invent the Future,” Wall Street Journal reporter Keach Hagey examines our AI-obsessed moment through one of its key figures — Sam Altman, co-founder and CEO of OpenAI. Hagey begins with Altman’s Midwest childhood, then takes readers through his career at startup Loopt, accelerator Y Combinator, [&#8230;]",
  "full_article": "In“The Optimist: Sam Altman, OpenAI, and the Race to Invent the Future,”Wall Street Journal reporter Keach Hagey examines our AI-obsessed moment through one of its key figures — Sam Altman, co-founder and CEO of OpenAI.\n\nHagey begins with Altman’s Midwest childhood, then takes readers through his career at startup Loopt, accelerator Y Combinator, and now at OpenAI. She alsosheds new light on the dramatic few dayswhen Altman was fired, then quickly reinstated, as OpenAI’s CEO.\n\nLooking back at what OpenAI employees now call “the Blip,” Hagey said the failed attempt to oust Altman revealed that OpenAI’s complex structure — with a for-profit company controlled by a nonprofit board — is “not stable.” And with OpenAIlargely backing down from plans to let the for-profit side take control, Hagey predicted that this “fundamentally unstable arrangement” will “continue to give investors pause.”\n\nDoes that mean OpenAI could struggle to raise the funds it needs to keep going? Hagey replied that it could “absolutely” be an issue.\n\n“My research into Sam suggests that he might well be up to that challenge,” she said. “But success is not guaranteed.”\n\nIn addition, Hagey’s biography (also available asan audiobook on Spotify) examines Altman’s politics, which she described as “pretty traditionally progressive” — making it a bit surprising that he’s struckmassive infrastructure dealswith the backing of the Trump administration.\n\n“But this is one area where, in some ways, I feel like Sam Altman has been born for this moment, because he is a deal maker and Trump is a deal maker,” Hagey said. “Trump respects nothing so much as a big deal with a big price tag on it, and that is what Sam Altman is really great at.”\n\nIn an interview with TechCrunch, Hagey also discussed Altman’s response to the book, his trustworthiness, and the AI “hype universe.”\n\nThis interview has been edited for length and clarity.\n\nYou open the book by acknowledging some of the reservations that Sam Altman had about the project —  this idea that we tend to focus too much on individuals rather than organizations or broad movements, and also that it’s way too early to assess the impact of OpenAI. Did you share those concerns?\n\nWell, I don’t really share them, because this was a biography. This project was to look at a person, not an organization. And I also think that Sam Altman has set himself up in a way where itdoesmatter what kind of moral choices he has made and what his moral formation has been, because the broad project of AI is really a moral project. That is the basis of OpenAI’s existence. So I think these are fair questions to ask about a person, not just an organization.\n\nAs far as whether it’s too soon, I mean, sure, it’s definitely [early to] assess the entire impact of AI. But it’s been an extraordinary story for OpenAI — just so far, it’s already changed the stock market, it has changed the entire narrative of business. I’m a business journalist. We do nothing but talk about AI, all day long, every day. So in that way, I don’t think it’s too early.\n\nAnd despite those reservations, Altman did cooperate with you. Can you say more about what your relationship with him was like during the process of researching the book?\n\nWell, he was definitely not happy when he was informed about the book’s existence. And there was a long period of negotiation, frankly. In the beginning, I figured I was going to write this book without his help — what we call, in the business, a write-around profile. I’ve done plenty of those over my career, and I figured this would just be one more.\n\nOver time, as I made more and more calls, he opened up a little bit. And [eventually,] he was generous to sit down with me several times for long interviews and share his thoughts with me.\n\nHas he responded to the finished book at all?\n\nNo. He did tweet about the project, about his decision to participate with it, but he was very clear that he was never going to read it. It’s the same way that I don’t like to watch my TV appearances or podcasts that I’m on.\n\nIn the book, he’s described as this emblematic Silicon Valley figure. What do you think are the key characteristics that make him representative of the Valley and the tech industry?\n\nIn the beginning, I think it was that he was young. The Valley really glorifies youth, and he was 19 years old when he started his first startup. You see him going into these meetings with people twice his age, doing deals with telecom operators for his first startup, and no one could get over that this kid was so smart.\n\nThe other is that he is a once-in-a-generation fundraising talent, and that’s really about being a storyteller. I don’t think it’s an accident that you have essentially a salesman and a fundraiser at the top of the most important AI company today,\n\nThat ties into one of the questions that runs through the book — this question about Altman’s trustworthiness. Can you say more about the concerns people seem to have about that? To what extent is he a trustworthy figure?\n\nWell, he’s a salesman, so he’s really excellent at getting in a room and convincing people that he can see the future and that he has something in common with them. He gets people to share his vision, which is a rare talent.\n\nThere are people who’ve watched that happen a bunch of times, who think, “Okay, what he says does not always map to reality,” and have, over time, lost trust in him. This happened both at his first startup and very famously at OpenAI, as well as at Y Combinator. So it is a pattern, but I think it’s a typical critique of people who have the salesman skill set.\n\nSo it’s not necessarily that he’s particularly untrustworthy, but it’s part-and-parcel of being a salesman leading these important companies.\n\nI mean, there also are management issues that are detailed in the book, where he is not great at dealing with conflict, so he’ll basically tell people what they want to hear. That causes a lot of sturm-und-drang in the management ranks, and it’s a pattern. Something like that happened at Loopt, where the executives asked the board to replace him as CEO. And you saw it happen at OpenAI as well.\n\nYou’ve touched on Altman’s firing, which was also covered ina book excerptthat was published in the Wall Street Journal. One of the striking things to me, looking back at it, was just how complicated everything was — all the different factions within the company, all the people who seemed pro-Altman one day and then anti-Altman the next. When you pull back from the details, what do you think is the bigger significance of that incident?\n\nThe very big picture is that the nonprofit governance structure is not stable. You can’t really take investment from the likes of Microsoft and a bunch of other investors and then give them absolutely no say whatsoever in the governance of the company.\n\nThat’s what they have tried to do, but I think what we saw in that firing is how power actually works in the world. When you have stakeholders, even if there’s a piece of paper that says they have no rights, they still have power. And when it became clear that everyone in the company was going to go to Microsoft if they didn’t reinstate Sam Altman, they reinstated Sam Altman.\n\nIn the book, you take the story up to maybe the end of 2024. There have been all these developments since then, which you’ve continued to report on, including this announcement that actually, they’re not fully converting to a for-profit. How do you think that’s going to affect OpenAI going forward?\n\nIt’s going to make it harder for them to raise money, because they basically had to do an about-face. I know that the new structure going forward of the public benefit corporation is not exactly the same as the current structure of the for-profit — it is a little bit more investor friendly, it does clarify some of those things.\n\nBut overall, what you have is a nonprofit board that controls a for-profit company, and that fundamentally unstable arrangement is what led to the so-called Blip. And I think you would continue to give investors pause, going forward, if they are going to have so little control over their investment.\n\nObviously, OpenAI is still such a capital intensive business. If they have challenges raising more money, is that an existential question for the company?\n\nIt absolutely could be. My research into Sam suggests that he might well be up to that challenge. But success is not guaranteed.\n\nLike you said, there’s a dual perspective in the book that’s partly about who Sam is, and partly about what that says about where AI is going from here. How did that research into his particular story shape the way you now look at these broader debates about AI and society?\n\nI went down a rabbit hole in the beginning of the book, [looking] into Sam’s father, Jerry Altman, in part because I thought it was striking how he’d been written out of basically every other thing that had ever been written about Sam Altman. What I found in this research was a very idealistic man who was, from youth, very interested in these public-private partnerships and the power of the government to set policy. He ended up having an impact on the way that affordable housing is still financed to this day.\n\nAnd when I traced Sam’s development, I saw that he has long believed that the government should really be the one that is funding and guiding AI research. In the early days of OpenAI, they went and tried to get the government to invest, as he’s publicly said, and it didn’t work out. But he looks back to these great mid-20th century labs like Xerox PARC and Bell Labs, which are private, but there was a ton of government money running through and supporting that ecosystem. And he says, “That’s the right way to do it.”\n\nNow I am watching daily as it seems like the United States is summoning the forces of state capitalism to get behind Sam Altman’s project to build these data centers, both in the United States and now there was just one last weekannounced in Abu Dhabi. This is a vision he has had for a very, very long time.\n\nMy sense of the vision, as he presented it earlier, was one where, on the one hand, the government is funding these things and building this infrastructure, and on the other hand, the government is also regulating and guiding AI development for safety purposes. And it now seems like the path being pursued is one where they’re backing away from the safety side and doubling down on the government investment side.\n\nAbsolutely. Isn’t it fascinating?\n\nYou talk about Sam as a political figure, as someone who’s had political ambitions at different times, but also somebody who has what are in many ways traditionally liberal political views while being friends with folks like — at least early on — Elon Musk and Peter Thiel. And he’s done a very good job of navigating the Trump administration. What do you think his politics are right now?\n\nI’m not sure his actual politics have changed, they are pretty traditionally progressive politics. Not completely — he’s been critical about things like cancel culture, but in general, he thinks the government is there to take tax revenue and solve problems.\n\nHis success in the Trump administration has been fascinating because he has been able to find their one area of overlap, which is the desire to build a lot of data centers, and just double down on that and not talk about any other stuff. But this is one area where, in some ways, I feel like Sam Altman has been born for this moment, because he is a deal maker and Trump is a deal maker. Trump respects nothing so much as a big deal with a big price tag on it, and that is what Sam Altman is really great at.\n\nYou open and close the book not just with Sam’s father, but with his family as a whole. What else is worth highlighting in terms of how his upbringing and family shapes who he is now?\n\nWell, you see both the idealism from his father and also the incredible ambition from his mother, who was a doctor, and had four kids and worked as a dermatologist. I think both of these things work together to shape him. They also had a more troubled marriage than I realized going into the book. So I do think that there’s some anxiety there that Sam himself is very upfront about, that he was a pretty anxious person for much of his life, until he did some meditation and had some experiences.\n\nAnd there’s his current family — he just had a baby and got married not too long ago. As a young gay man, growing up in the Midwest, he had to overcome some challenges, and I think those challenges both forged him in high school as a brave person who could stand up and take on a room as a public speaker, but also shaped his optimistic view of the world. Because, on that issue, I paint the scene of his wedding: That’s an unimaginable thing from the early ‘90s, or from the ‘80s when he was born. He’s watched society develop and progress in very tangible ways, and I do think that that has helped solidify his faith in progress.\n\nSomething that I’ve found writing about AI is that the different visions being presented by people in the field can be so diametrically opposed. You have these wildly utopian visions, but also these warnings that AI could end the world. It gets so hyperbolic that it feels like people are not living in the same reality. Was that a challenge for you in writing the book?\n\nWell, I see those two visions — whichfeelvery far apart — actually being part of the same vision, which is that AI is super important, and it’s going to completely transform everything. No one ever talks about the true opposite of that, which is, “Maybe this is going to be a cool enterprise tool, another way to waste time on the internet, and not quite change everything as much as everyone thinks.” So I see the doomers and the boomers feeding off each other and being part of the same sort of hype universe.\n\nAs a journalist and as a biographer, you don’t necessarily come down on one side or the other — but actually, can you say where you come down on that?\n\nWell, I will say that I find myself using it a lot more recently, because it’s gotten a lot better. In the early stages, when I was researching the book, I was definitely a lot more skeptical of its transformative economic power. I’m less skeptical now, because I just use it a lot more.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}