{
  "title": "Left-leaning influencers embrace Bluesky without abandoning X, Pew says",
  "date": "Sat, 31 May 2025 21:01:57 +0000",
  "link": "https://techcrunch.com/2025/05/31/left-leaning-influencers-embrace-bluesky-without-abandoning-x-pew-says/",
  "summary": "It’s no surprise that many big, left-leaning social media accounts have recently joined Bluesky — but a new analysis from the Pew Research Center attempts to quantify that shift. This comes as an update to Pew’s news influencer report released in November 2024, which did not include Bluesky in its numbers. The report focused on [&#8230;]",
  "full_article": "It’s no surprise that many big, left-leaning social media accounts have recently joined Bluesky — buta new analysisfrom the Pew Research Center attempts to quantify that shift.\n\nThis comes as an update toPew’s news influencer reportreleased in November 2024, which did not include Bluesky in its numbers. The report focused on a relatively small group of 500 influencers, all of whom have more than 100,000 followers on at least one major platform and post regularly about current events.\n\nFor this Bluesky-centric update, Pew looked at those same influencers (as opposed to accounts that may have found a big audience on Bluesky exclusively) and saw that in February/March, 43% of them had an account on Bluesky. Just over half (51%) of those accounts were created after the 2024 presidential election.\n\nThere’s a big divide between influencers on the right and the left, with 69% of the left-leaning accounts (the ones that explicitly identified as liberals or Democrats and expressed support for Kamala Harris or Joe Biden before the presidential election) making the jump to Bluesky, while only 15% of the conservative ones did the same.\n\nThis movement wasn’t necessarily at the expense of X (formerly Twitter). While X owner Elon Musk’s alliance with now-President Donald Trump seemed todrive new users to Bluesky, 82% of the influencers tracked by Pew still had an account on X, down only slightly from 85% in summer 2025.\n\nIn other words, even if left-leaning influencers are dipping their toes into Bluesky, most of them (87%) haven’t abandoned X. Pew also says most influencers continue to post more regularly on X than on Bluesky.\n\nHowever, Bluesky activity does appear to be picking up — the number of influencers on Bluesky who are actually posting grew from 54% in the first week of January to 66% in the last full week of March.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}