{
  "title": "NAACP calls on Memphis officials to halt operations at xAI’s ‘dirty data center’",
  "date": "Sat, 31 May 2025 20:05:44 +0000",
  "link": "https://techcrunch.com/2025/05/31/naacp-calls-on-officials-to-halt-operations-at-xais-dirty-data-center-in-memphis/",
  "summary": "The NAACP is calling on local officials to halt operations at Colossus, the “supercomputer” facility operated by Elon Musk’s xAI in South Memphis. As reported in NBC News, leaders from the civil rights group sent a letter Thursday to the Shelby County Health Department and Memphis Light Gas and Water criticizing the organizations’ “lackadaisical approach [&#8230;]",
  "full_article": "The NAACP is calling on local officials to halt operations at Colossus, the “supercomputer” facility operated by Elon Musk’s xAI in South Memphis.\n\nAsreported in NBC News, leaders from the civil rights groupsent a letter Thursdayto the Shelby County Health Department and Memphis Light Gas and Water criticizing the organizations’ “lackadaisical approach to the operation of this dirty data center” and calling on them to “issue an emergency order for xAI to stop operations completely” — or if there’s no order, to at least cite and stop the company from allegedly violating clean air laws.\n\nThe letter expressed particular concerns around the gas turbines that xAI runs to power Colossus. The company has applied for a permit tocontinue operating 15 gas turbinesat the facility, although the NAACP said authorities have “allowed xAI to operate at least 35 gas turbines without any permitting” over the past year. City officials have previously said xAI did not need permits for the turbines’ first year of use.\n\nThese turbinesreportedly emit hazardous air pollutants, including formaldehyde, at levels exceeding EPA limits. The NAACP’s letter also pointed to the turbines’ nitrogen-oxide emissions.\n\nNoting that the Colossus facility is located near South Memphis’ Boxtown neighborhood, which the letter described as a “historically Black community,” the NAACP said the location perpetuates “the trend of industries adding pollution to communities who do not cause the problem.”\n\n“Instead of [the Shelby County Health Department] working to reduce health issues known in the area including that cancer risks are already four times the national average, it has allowed xAI to operate above the law,” the NAACP added.\n\nThe NAACP’s letter is addressed to Shelby County Health Department Director Michelle Taylor, as well as Memphis Light Gas and Water’s commissioners; Taylor isleaving her rolein Shelby County to become the commissioner of the Baltimore City Health Department.\n\nTechCrunch has reached out to the NAACP and xAI for comment. A spokesperson for Memphis Light Gas and Water told NBC News that it had not yet received the NAACP letter.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}