{
  "title": "Week in Review: Perplexity Labs wants to do your work",
  "date": "Sat, 31 May 2025 17:06:00 +0000",
  "link": "https://techcrunch.com/2025/05/31/week-in-review-perplexity-labs-wants-to-do-your-work/",
  "summary": "We've got a ton of stories for you this week, including a new AI-powered browser from Arc; not one but TWO hacks; Gemini email summaries; and much more.",
  "full_article": "Welcome back to Week in Review! We’ve got a ton of stories for you this week, including a new AI-powered browser from Arc; not one but TWO hacks; Gemini email summaries; and much more. Have a great weekend!\n\nLook out, Google:AI-powered search enginePerplexity released Perplexity Labs, which gives Pro subscribers a tool that can craft reports, spreadsheets, dashboards, and more. Perplexity Labs can conduct research and analysis using tools like web search, code execution, and chart and image creation to craft reports and visualizations. All in around 10 minutes. We haven’t had a chance to test it, and knowing the shortcomings of AI, I’m sure not everything will come out flawlessly. But it certainly sounds pretty awesome.\n\nLuckey’s luck:The feud between Oculus founder Palmer Luckey and Mark Zuckerberg appears to be over: The pair announced acollaboration between Facebook and Luckey’s company Andurilto build extended reality (XR) devices for the U.S. military. The product family they’re building is called EagleEye, which will be an ecosystem of devices.\n\nNot awesome:We don’t definitively know whether AI is beginning to take over roles previously done by humans. But a recent World Economic Forum survey found that40% of employersplan to cut staff where AI can automate tasks. That can’t be good.\n\nThis is TechCrunch’s Week in Review, where we recap the week’s biggest news. Want this delivered as a newsletter to your inbox every Saturday?Sign up here.\n\nEveryone’s making a browser:The Browser Company said this week that it’s considering selling or open sourcing its browser, Arc Browser, tofocus on a new AI-powered browsercalled Dia. And it’s not the only one! Opera also said it’s building a newAI-focused browser, andPerplexity teased its browser, Comet, a few months ago.\n\nAt last:iPad users, rejoice! You can now talk to all your international friends with thenew iPad-specific version of WhatsApp. Meta says that users will be able to take advantage of iPadOS multitasking features, such as Stage Manager, Split View, and Slide Over.\n\nOh, great:LexisNexis Risk Solutions, a data broker that uses personal information to help companies spot risks and fraud,reported a security breachaffecting more than 364,000 people. A LexisNexis spokesperson told us that an unknown hacker accessed the company’s GitHub account, and the stolen data includes names, dates of birth, phone numbers, postal and email addresses, Social Security numbers, and driver’s license numbers.\n\nAnd another one:Hackersreportedly accessed the personal phoneof White House chief of staff Susie Wiles, obtaining contact information used to impersonate her and contact other high-ranking officials. It seems that AI was used to impersonate her voice.\n\nCan it cook my meals?Gmail users no longer have to tap an option to summarize an email with AI. The AI will nowautomatically summarize the contentwhen needed, without requiring user interaction. That means you have to opt out if you don’t want Gemini summarizing your stuff.\n\nBillion with a B:General Catalyst hasinvested $1 billion into Grammarly, the 16-year-old writing assistant startup. Grammarly will use the new funds for its sales and marketing efforts, freeing up existing capital to make strategic acquisitions.\n\nIn the heights:Tinder is testing a new feature that willallow people to add a “height preference”in their search for love. This isn’t a hard filter, Tinder says, as it won’t actually block or exclude profiles but instead inform recommendations.\n\n10 years in the making:Carma Technology, which was formed in 2007 by SOSV Ventures founder Sean O’Sullivan,filed a lawsuit earlier this year against Uber, alleging the company infringed on five of its patents. The lawsuit is fairly new, but the allegations go back almost a decade.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}