{
  "title": "Space Forge raises $30M Series A to make chip materials in space",
  "date": "Sat, 31 May 2025 16:00:00 +0000",
  "link": "https://techcrunch.com/2025/05/31/space-forge-raises-30m-series-a-to-make-chip-materials-in-space/",
  "summary": "Space Forge, a U.K. startup headquartered in Cardiff, Wales, recently raised a £22.6 million (approximately $30 million) Series A  to make wafer materials in space, where unique conditions unlock new possibilities.",
  "full_article": "From AI to EVs, demand for semiconductors is exploding, but silicon is hitting its limits. Making more efficient chips requiresnew materials, ones far less ubiquitous than sand, but the solution might be out there — literally.\n\nSpace Forge, a U.K. startup headquartered in Cardiff, Wales, recently raised a £22.6 million (approximately $30 million) Series A to make wafer materials in space, where unique conditions unlock new possibilities.\n\nFor instance, the Welsh startup earlier won funding for aprojectthrough which BT (formerly British Telecom) is hoping to test how integrating crystal materials grown in space could reduce the power consumption of its 5G towers. Because of weightlessness and other properties, crystals made in space have fewer defects, which can help devices use less energy.\n\nReal-world use cases like this help Space Forge convey the message that critical systems could use its technology as an invisible backbone. The whole idea of making chips in orbit may sound like science fiction, but its feasibility has been knownsince the 1970s, CEO Joshua Western told TechCrunch.\n\n“We’re stood on the shoulders of about 50 years of research when it comes to not only knowing that this is possible, but also knowing that there is a profound improvement in doing so,” Western said.\n\nThe improvement in question is obtaining crystals and advanced semiconductor materials with fewer defects and enhanced performance, making them appealing for use in applications such as quantum computing and defense systems.\n\nThis dual-use potential explains whyNATO Innovation Fundled Space Forge’s Series A, and why major U.S. defense contractor Northrop Grumman isone of its partners.\n\nPartners will be key to Space Forge’s trajectory: The company won’t build rockets and is instead relying on existing space providers for the launch part — a “solved problem,” in Western’s words.\n\nIt’s not just the rockets; from chip manufacturing to space return, Space Forge is tying together technologies that may be described as solved problems, at least on paper. But if you ask Western about its moat, he has a quick retort: “How bloody hard is it to do?!”\n\nThat’s the price to pay to take advantage of space’s unique environment: It requires adapting to harsh conditions such as extreme temperatures and microgravity, Western said. “Physics has the answers, and engineering is how you actually get there.”\n\nEngineering is also needed to bridge the gap between innovation and commercially viable technology. Rather than capsules like Apollo’s, Space Forge returns its materials to Earth as “Mary Poppins from space.” Western explained the nickname: “We deploy something that looks very much like an umbrella, [but] that’s space grade, and that allows us to float back from space down to the ground.”\n\nDeveloping new return technology is a key focus of Space Forge. Besides its heat shield, Pridwen, a nod to the legend of King Arthur, the startup alsodeveloped Fielder, a floating net to catch returning satellites and ensure a soft landing on water. These efforts were supported by the U.K. Space Agency and European Space Agency, of which the U.K. is still a member despite Brexit.\n\nEstablishing a return infrastructure across Europe is one of Space Forge’s ambitions — and it is underway. This week, the companyopened an office in Portugalon the island of Santa Maria in the Azores, a well-suited location for satellite return in mainland Europe and an important step to convince European partners that this approach can reach industrial scale.\n\nThe increasing commoditization of both return and launch technologies is what made therise of in-space manufacturing startupspossible in the first place, with applications also including drug discovery and telecom hardware. But their viability is still very dependent on costs coming down, or in finding clients willing to pay that premium.\n\nShifting geopolitics could help Space Forge secure more of these clients. Western and his co-founder and CTO Andrew Bacon previously worked at Thales Alenia Space, a joint venture between Thales and its Italian peer Leonardo. But the trend is broader than just defense, as concerns mount across Europe over reliance on semiconductors from Taiwan.\n\n“We urgently need a resilient, homegrown supply of the next-gen supermaterials required for the future of compute. We also need this homegrown chip supply to be produced sustainably,” World Fund general partner Daria Saharova wrote in a statement.\n\nTheclimate tech VC firm, which co-ledSpace Forge’s seed roundand participated in its Series A, is buying into Space Forge’s positioning as a “carbon negative technology” thatcould fight climate change. However, the emissions savings have yet to be proven at scale and rely on commercial adoption to truly offset each mission.\n\nSpace Forge, though, still has to complete its first mission. Its first attempt ended after a grand total of six and a half minutes whenVirgin Orbit’s rocket suffered an anomalyin its launch of Cornwall in 2023, losing its entire payload, including Space Forge’s ForgeStar-0 satellite.\n\nWith its new funding, the company is now accelerating the development of its latest spacecraft and readying for the launch of its ForgeStar-1 demonstrator later this year, together with Pridwen. And in a nod to the galaxy far, far away, Space Forge announced the mission’s official name — “The Forge Awakens” — on May 4.\n\nAnna Heim met and interviewed Joshua Western and Daria Saharova at a World Fund event that the VC firm covered her travel costs to attend; this article was written independently.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}