{
  "title": "Google quietly released an app that lets you download and run AI models locally",
  "date": "Sat, 31 May 2025 14:04:46 +0000",
  "link": "https://techcrunch.com/2025/05/31/google-quietly-released-an-app-that-lets-you-download-and-run-ai-models-locally/",
  "summary": "Last week, Google quietly released an app that lets users run a range of openly available AI models from the AI dev platform Hugging Face on their phones. Called Google AI Edge Gallery, the app is available for Android and will soon come to iOS. It allows users to find, download, and run compatible models [&#8230;]",
  "full_article": "Last week, Google quietly released an app that lets users run a range of openly available AI models from the AI dev platform Hugging Face on their phones.\n\nCalledGoogle AI Edge Gallery, the app is available for Android and will soon come to iOS. It allows users to find, download, and run compatible models that generate images, answer questions, write and edit code, and more. The models run offline, without needing an internet connection, tapping into supported phones’ processors.\n\nAI models running in the cloud are often more powerful than their local counterparts, but they also have their downsides. Some users might be wary of sending personal or sensitive data to a remote data center, or want to have models available without needing to find a Wi-Fi or cellular connection.\n\nGoogle AI Edge Gallery, which Google is calling an “experimental Alpha release,” can be downloaded from GitHub by followingthese instructions. The home screen shows shortcuts to AI tasks and capabilities like “Ask Image” and “AI Chat.” Tapping on a capability pulls up a list of models suited for the task, such as Google’sGemma 3n.\n\nGoogle AI Edge Gallery also provides a “Prompt Lab” users can use to kick off “single-turn” tasks powered by models, like summarizing and rewriting text. The Prompt Lab comes with several task templates and configurable settings to fine-tune the models’ behaviors.\n\nYour mileage may vary in terms of performance, Google warns. Modern devices with more powerful hardware will predictably run models faster, but the model size also matters. Larger models will take more time to complete a task — say, answering a question about an image — than smaller models.\n\nGoogle’s inviting members of the developer community to give feedback on the Google AI Edge Gallery experience. The app is under an Apache 2.0 license, meaning it can be used in most contexts — commercial or otherwise — without restriction.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}