{
  "title": "A guide to using Edits, Meta’s new CapCut rival for short-form video editing",
  "date": "Sat, 31 May 2025 14:00:00 +0000",
  "link": "https://techcrunch.com/2025/05/31/a-guide-to-using-edits-metas-new-capcut-rival-for-short-form-video-editing/",
  "summary": "Meta shared that it was working on Edits in January after ByteDance-owned CapCut was removed from U.S. app stores.",
  "full_article": "Meta recentlyreleased a new video editing appfor creators called Edits. The new app is designed to rival ByteDance’s CapCut, a popular short-form video-editing app used by many creators.\n\nMeta first shared that it was working on Edits back in January after ByteDance-owned CapCut was removed from U.S. app stores when the TikTok ban momentarily went into effect. Although the app has since come back online and is available to download, TikTok’s future in the U.S. remains uncertain, so Meta is ready to capitalize on CapCut’s possible absence in the future with its new Edits app.\n\nWe’ve created this guide to walk you through the app and the different features it offers, and we provide an overview of how it compares to CapCut.\n\nEdits is available to download on bothiOSandAndroid. Once you download the app and open it, you will be asked to log in with your Instagram account.\n\nFrom there you will see five main tabs: Ideas, Inspiration, Projects, Record, and Insights. The Ideas tab offers creators a space to jot down ideas for new videos and save reels to a collection, and the Inspiration tab features a hub for discovering trending audios and other popular reels.\n\nThe Projects tab is where creators can store and revisit the videos they currently have in progress. This tab is also where creators can upload videos from their phone’s camera roll. The Record tab lets creators start filming video content right within Edits. Lastly, the Insights tab gives creators an overview of how their content is performing by surfacing metrics like views, reach, and follower counts.\n\nGreen screen:Replace and edit the background of your videos with one tap.\n\nTimeline:Precisely arrange and adjust clips.\n\nCaptions:Add automatic captions to your videos in multiple languages.\n\nAudio library:Add music from Instagram’s library to your videos.\n\nCutouts:Isolate specific objects with precision tracking.\n\nAnimate:Turn static images into videos using AI.\n\nApply all:Apply filters, effects, transitions, and adjustments to all of your clips at once.\n\nTimeline frame rate selector:Convert your video to the frame rate you want in order to enhance playback smoothness.\n\nAlignment guides:Ensure viewers can see the important parts of your video when posted and accurately position text, emoji, or other elements.\n\nBeat markers:Add auto-detected beat markers to help you align clips, text, and overlays with audio when editing.\n\nFilters:Choose from 30 different filter options to add a unique look to your videos.\n\nTransitions:Choose from 30 different transitions to connect different video clips in a seamless way.\n\nWhile both Edits and CapCut are great options for editing short-form videos, there are some differences between the two services.\n\nCapCut offers more robust editing options, including AI features, than Edits does. Of course, this can be expected since Edits is a lot newer than CapCut. Meta will likely continue to build out Edits over the next months and years, so we can expect to see more advanced functionality in the future. It’s also worth noting that CapCut has a more extensive music library compared to Edits.\n\nAnother difference is the fact that Edits currently doesn’t have a subscription offering (for now), but CapCut does. While CapCut offers a free version, some of its advanced tools are locked behind a paid subscription. Edits is free to use, but this will likely change in the future, as Instagram headAdam Mosserihas statedthat later versions of Edits may include paid features.\n\nIn addition, while CapCut is available on the web, Edits is mobile-only. However, this could change in the future.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}