{
  "title": "Yep, X was down again",
  "date": "Fri, 30 May 2025 20:54:34 +0000",
  "link": "https://techcrunch.com/2025/05/30/yep-x-was-down-again/",
  "summary": "People reported that photos weren't loading, its banking service XMoney wasn't working, and search wasn't returning any results, among other things.",
  "full_article": "Elon Musk’s X experienced an outage on Friday, according to user reports and crowdsourced data from sites likeDowndetector. From what TechCrunch staff has witnessed firsthand, the X website and app still loaded, but various features were not functioning properly, and entire feeds — like X’s algorithmic For You feed — didn’t load any content.\n\nOthers reported thatphotos weren’t loading,X’sbanking service XMoneywasn’t working, the timeline was bare, posts weren’t publishing, and search wasn’t returning results, among other things.\n\nBased on the timing of the user reports, the outage and errors seem to have begun just before 4 p.m. ET on Friday and seem to be resolving as of the time of writing.\n\nDuring the outage,thousands of users submitted reports to Downdetector,and others more directly complained in X posts and on other social networks, like Bluesky and Threads.\n\nThis was the second outage for X in just over a week, as the service also failedon May 22,when X experienced a number of issues over a 24-hour period. During that time, messages wouldn’t load, timelines wouldn’t update, and some posts couldn’t be seen without refreshing the webpage.\n\nThe current outage may be short-lived. We noticed that some features seemed to either be intermittently working, or worked on X’s mobile app but not on the desktop, for instance. Then, people began reporting that the service seemed to have come back up.\n\nThe X Developer API v2 is stillshowingdegraded status, however.\n\nJust ahead of the outage, X beganrolling out its new DM feature, XChat, into beta afterpausing encrypted DMsas it worked to make improvements. It’s not clear if any of these changes impacted X’s stability, and the company no longer responds to press inquiries since Musk took ownership.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}