{
  "title": "TechCrunch Mobility: A ride-sharing pioneer comes for Uber, Tesla loses more ground, and dog-like delivery robots land in Texas",
  "date": "Fri, 30 May 2025 20:15:00 +0000",
  "link": "https://techcrunch.com/2025/05/30/techcrunch-mobility-a-ride-sharing-pioneer-comes-for-uber-tesla-loses-more-ground-and-dog-like-delivery-robots-land-in-texas/",
  "summary": "Welcome back to TechCrunch Mobility — your central hub for news and insights on the future of transportation.",
  "full_article": "Welcome back toTechCrunch Mobility— your central hub for news and insights on the future of transportation. Sign up here for free — just clickTechCrunch Mobility!\n\nIt might have been a short week, but there was still plenty of news, including anotherZooxrecall, an update on theStellantis-Amazonpartnership, and a few startup-funding deals.\n\nOne item of note: This week, I wrote aboutCarma Technologyand itspatent infringement lawsuitagainstUber. This isn’t a patent troll situation, and the IP attorneys I have spoken with say it will be a challenging case for Uber.\n\nThe gist? Carma, which was formed in 2007 by serial entrepreneur and SOSV Ventures founder Sean O’Sullivan, filed a lawsuit earlier this year against Uber, alleging the company infringed on five of its patents that are related to the system of matching riders (or packages) with capacity in vehicles. In other words, ride-sharing.\n\nIP attorney Larry Ashery provided the money quote that explains why this is such a complicated and challenging case.\n\n“What’s important to understand here is, Carma isn’t just asserting five patents. They have had a very sophisticated strategy of patent procurement that they’ve been working on for the past 18 years.”Carma’s five patents are part of a 30-patent family that are all related and connected to the original filing date. That matters because each of the five asserted patents contains multiple patent claims, which define the legal boundaries of the invention. These individual claims — not just the patents as a whole — are what Carma is asserting against Uber.\n\nThat means Uber will have to address and defend against each asserted claim, making the litigation more complex and difficult to defeat, Ashery noted.\n\nLet’s get into the rest of the news.\n\nA few little birds have been chirping at us for months now about a new autonomous vehicle technology startup that has been quietly plugging along for a year. The interesting nugget about this startup — which is calledBedrock Robotics— is who is behind it:Boris Sofman, who ledWaymo’s self-driving trucks program and previously co-founded and led the popular consumer robotics companyAnki.\n\nThe San Francisco-based startup is still in stealth, but my sources tell me it has raised considerable venture funds. Bedrock Robotics is working on a self-driving kit that retrofits onto construction equipment and other heavy machinery,according to a filingwith the U.S. Patent and Trademark Office.\n\nGot a tip for us? Email Kirsten Korosec atkirsten.korosec@techcrunch.comor my Signal at kkorosec.07, Sean O’Kane atsean.okane@techcrunch.com, or Rebecca Bellan atrebecca.bellan@techcrunch.com.Or check outthese instructionsto learn how to contact us via encrypted messaging apps or SecureDrop.\n\nFirefly Aerospacereceived a$50 million investmentfrom Northrop Grumman as part of its Series D round. This investment will further advance production of the startup’s  co-developed medium launch vehicle, now known as Eclipse.\n\nPallet, a warehouse logistics software startup based in Fremont, California,raised $27 millionin a Series B funding round led by General Catalyst. Bain Capital Ventures, Activant Capital, and Bessemer Venture Partners also participated.\n\nVolteras, a London-based startup building virtual connective tissue that will allow plugged-in EVs to offer their batteries to support the grid, closed an$11.1 million Series Aled by Union Square Ventures, with participation from Edenred, Exor, Long Journey Ventures, and Wex.\n\nWay Data Technologies, a fleet management startup founded by veterans of Lucid Motors and Wolt,raised €2.6 million($2.95 million) in pre-seed funding led by Pale Blue Dot, with participation from 10x Founders and Greens Ventures.\n\nRivr’sfour-wheeled, stair-climbing delivery robot— which its CEO and founder, Marko Bjelonic, describes as a dog on roller skates — will ferry packages fromVehovans directly to customers’ front doors as part of a pilot program in Austin, Texas. Both companies see this small pilot as a critical step toward solving a unique slice of the end-to-end autonomous delivery journey.\n\nTuSimple(now CreateAI)sent a trove of sensitive data— effectively the blueprint of an American-made autonomous vehicle system — to a Beijing-owned firm after committing to the U.S. government that it would cease such transfers under a national security agreement. The revelation, first reported by the Wall Street Journal, prompted numerous “not surprised” responses from several readers and sources within the industry.\n\nZooxissued itssecond voluntary softwarerecall in a month, following a collision between one of its robotaxis and an e-scooter rider in San Francisco on May 8. The incident is notable, largely for what happened after the unoccupied Zoox vehicle operating at low speed was struck by the e-scooter after braking to yield at an intersection.\n\nAccording to Zoox, the e-scooterist fell to the ground directly next to the vehicle and the “robotaxi began to move and stopped after completing the turn, but did not make further contact with the e-scooterist.”\n\nIn other Zoox news, the company announced it was the “official robotaxi partner of Resorts World Las Vegas.” As part of the deal, there will be a dedicated and Zoox-branded robotaxi pickup and drop-off location at Resorts World Las Vegas.\n\nTheTesla Cybertruckis having a rough time. Dozens of unsold Tesla Cybertrucks arepiling up at a Detroit shopping center parking lot. And while Cybertruck owners are now allowed by Teslato trade in their vehiclesfor the first time since they hit the market, they’ll face a steep depreciation hit. CarGurus recently showed depreciation rates of up to 45%.\n\nMeanwhile,Teslasales in Europe and the U.K.have fallen by nearly half, according to data released by the European Automobile Manufacturers Association.\n\nTheVolkswagenemissions cheating scandal of 2015 rippled through the automotive sector and prompted the company (and later followed by others) to shift away from diesel and toward hybrids and electric vehicles. Now, four former Volkswagen executives havereceived prison sentencesfor their role.\n\nAmazonis no longer working withStellantisto createin-car software for the automaker’s vehicles. The partnership, first announced in January 2022, was part of Stellantis’ plan to generate $22.5 billion annually from software. Stellantis told TechCrunch it would be pivoting to an Android-based system.\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}