{
  "title": "DOGE left United States Institute of Peace office with water damage, rats, and roaches",
  "date": "Fri, 30 May 2025 19:36:22 +0000",
  "link": "https://techcrunch.com/2025/05/30/doge-left-united-states-institute-of-peace-office-with-water-damage-rats-and-roaches/",
  "summary": "The chief executive of the United States Institute of Peace (USIP) says Elon Musk's DOGE left the nonprofit's Washington, D.C., headquarters in disarray.",
  "full_article": "The chief executive of the United States Institute of Peace (USIP) says Elon Musk’s Department of Government Efficiency left the nonprofit’s Washington, D.C., headquarters in disarray, full of water damage, rats, and roaches, according toa new sworn statementfirst reported byCourt Watch.\n\nThe statement from the executive, George Moose, comes just a few days after a federal judgeruledthat DOGE’s takeover of the nonprofit was illegal. And this week, Musk has claimed he is stepping away from DOGE, although he and President Trump have said he will continue to advise the administration.\n\nDOGEstarted its takeoverof USIP in mid-March after a standoff that saw the nonprofit call the police on Musk’s government workers. Moose said at the time that DOGE staff had “broken into” the USIP headquarters in Washington, despite the fact that the nonprofit is not part of the executive branch and isn’t subject to the White House’s whims.\n\n“It was very clear that there was a desire on the part of the administration to dismantle a lot of what we call foreign assistance, and we are part of that family,” Moose said at the time, referencing the Trump administration’s and DOGE’s dismantling of the United States Agency for International Development.\n\nMoose initiallysaidthe nonprofit’s headquarters appeared to be in decent shape at a press conference on May 21, where he discussed the judge’s ruling. But one day later, according to the statement, members of Moose’s staff spent a day surveying the building and documenting the problems they found.\n\nMoose wrote in his statement that, ahead of the judge’s ruling, the headquarters had been “essentially abandoned for many weeks” before USIP regained control. He said that DOGE had failed to “maintain and secure the building,” including “evidence of rats and roaches.”\n\n“Vermin were not a problem prior to March 17, 2025, when USIP was actively using and maintaining the building,” Moose wrote.\n\nStaff also reported to Moose that the building’s vehicle barriers were poorly maintained and that they spotted water leaks and “missing ceiling tiles in multiple places in the building (which I have been told suggest likely water damage).”\n\nNow Moose said USIP has “engaged a private security firm to guard the building and premises” and “taken over responsibility for the building’s maintenance.”\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}