{
  "title": "Trump administration to claw back $3.7B in clean energy and manufacturing awards",
  "date": "Fri, 30 May 2025 18:45:49 +0000",
  "link": "https://techcrunch.com/2025/05/30/trump-administration-to-claw-back-3-7b-in-clean-energy-and-manufacturing-awards/",
  "summary": "Large corporations and growing startups were wrapped up in the latest move by the Trump administration to undo Biden-era contracts.",
  "full_article": "The Department of Energy announced today that it would be clawing back $3.7 billion worth of awards made under the Biden administration for clean energy and manufacturing. Large corporations and growing startups were caught up in the decision.\n\nEnergy secretary Chris Wright said the moves were “due diligence” on the part of the Trump administration. His statement did not cite specific reasons why the projects were canceled, but pointed to amemorandumhe issued on May 15, which suggests that the department may attempt to use its audit powers to rescind the awards.\n\nIn total, 24 projects are affected by the move, including ones being developed by oil and gas giant Exxon Mobil, food manufacturer Kraft Heinz, industrial heat startup Skyven, cement and alumina startup Brimstone, and cement startup Sublime Systems.\n\nHere’s a sampling of some of the awards in jeopardy:\n\nSublime told TechCrunch that it was caught off guard.\n\n“Sublime was surprised and disappointed to receive the news about the termination of our Industrial Demonstrations Program award, given the clear progress we’ve made in scaling our American-invented technology, partnering with some of the Western World’s largest cement producers, and generating a bankable customer base,” spokesperson Rob Kreis said via email. The startup is evaluating its options to continue scaling up its operations.\n\nBrimstone is hopeful that things can be resolved with the DOE.\n\n“Given our project’s strong alignment with President Trump’s priority to increase U.S. production of critical minerals, we believe this was a misunderstanding. Brimstone’s Rock Refinery represents the only economically viable way to produce the critical mineral alumina in the U.S. from U.S.-mined rocks,” Brimstone spokesperson Liza Darwin told TechCrunch via email.\n\n“As the first U.S.-based alumina plant in a generation, our project — which would also make portland cement — would clear a ‘mine-to-metal’ path for U.S. aluminum production, fortifying the U.S. critical mineral supply chain and creating thousands of jobs,” she added.\n\n\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}