{
  "title": "Automattic says it will start contributing to WordPress again after pause",
  "date": "Fri, 30 May 2025 17:25:44 +0000",
  "link": "https://techcrunch.com/2025/05/30/automattic-says-it-will-start-contributing-to-wordpress-again-after-pause/",
  "summary": "WordPress.com parent company Automattic is changing direction... again.",
  "full_article": "WordPress.com parent company Automattic is changing direction… again.\n\nIna blog posttitled “Returning to Core” published Thursday evening, Automattic announced it will unpause its contributions to the WordPress project. This is despite having said only last monththat the 6.8 WordPress releasewould be the final major release for all of 2025.\n\n“After pausing our contributions to regroup, rethink, and plan strategically, we’re ready to press play again and return fully to the WordPress project,” the new blog post states. “Expect to find our contributions across all of the greatest hits — WordPress Core, Gutenberg, Playground, Openverse, and WordPress.org. This return is a moment of excitement for us as it’s about continuing the mission we’ve always believed in: democratizing publishing for everyone, everywhere,” it reads.\n\nAutomattic says it’s learned a lot from the pause in terms of the many ways WordPress is used, and that it’s now committed to helping it “grow and thrive.”\n\nThe post also notes that WordPress today powers 43% of the web.\n\nIt’s unclear what has changed.\n\nHowever, according to sources who spoke to TechCrunch, Automattic CEO Matt Mullenweg explained in an internal post published last night that he wants to get a 6.9 release out this year with an admin refresh and something from the “new AI team.” (The latter references this week’s announcement thatWordPress formed a new team to steward the development of AI projects.)\n\n“I don’t think that will happen without our contributions,” the post stated, according to a source familiar with the internal discussions.\n\nInsiders are speculating there’s more to it than that, and various theories are being floated. Some wonder if Mullenweg was pressured into this move or if he realized that pulling back wasn’t good for his business or its reputation? Others are debating if this change of heart has to do with Automattic’s ongoing litigation with WordPress’ hosting company, WP Engine, which Automattic has called a “threat” to the WordPress communityand a “cancer to WordPress.”\n\nNo one knows what to believe, and none of these backchannel theories line up with the officially stated reason.\n\nAutomattic was asked for additional comment.\n\nSince 2024, Automattic has been engaged in a legal dispute that has to do with how little, in Mullenweg’s opinion, WP Engine contributes to the WordPress project, despite its size and revenue.\n\nHe sees the hosting company as profiting off the open source work WordPress is doing without giving back. Mullenweg also alleges that WP Engine benefits from the confusion between WordPress and commercial services like WP Engine. This led him to ban the company from accessing WordPress.org and sue in court forunauthorized trademark usage.\n\nSimply put, Mullenweg thinks WP Engineshould either paya direct licensing fee or up its contributions to the open source WordPress project, or shouldn’t be allowed to use its trademark.\n\nWP Enginerespondedthat it doesn’t think it needs a license and that Automattic misunderstands trademark law,suing Automattic in return.\n\nLast month,Automattic laid off 16% of staff,saying the restructuring was necessary to be more agile and improve its productivity and profitability.\n\nSarah Perez can be reached at @sarahperez.01 on Signal and sarahp@techcrunch.com .\n\nTopics\n\n© 2025 TechCrunch Media LLC."
}